[{	"title" : "什么是我的小尼克学堂？",
"answer" : "<p>我的小尼克学堂是第一个寓教于乐的视频课程，课程内容可由家长根据孩子的喜好，特点定制。它是一个独特的视频观看体验，让孩子在学习的同时获得乐趣！</p> <p>家长可以根据孩子年龄，性别以及喜好的教育主题为他们的孩子定制课程，同时还能为他们的孩子控制每次的观看时长。</p> <p>我的小尼克学堂不断适应每个孩子的喜好。在每一个发展阶段，在父母为其定制的学习过程中，孩子都能够随时反馈自己的观看意见。</p>"},
{	"title" : "为什么要控制观看时间？",
"answer" : "<p>能够控制观看时间可以让家长限制孩子的观看时间，以便他们观看“适量”学习内容。这项服务允许您调整孩子的观看时长，不仅根据他们的年龄，而且根据他们的日程安排。</p>"},
{	"title" : "为什么要填写您孩子的姓名，年龄和性别？",
"answer" :	"<p>提供孩子的生日和性别，我的小尼克学堂可以基于相同的年龄和性别的其他孩子们的喜好，为您的孩子推荐合适的视频课程。每个订户最多可以可以创建三个不同的定制课程。提供孩子的名字可以让每个孩子轻松找到自己的定制课程。</p>"},
{	"title" : "用户信息与资料的用途？",
"answer" :	" <p>个人资料将被严格保密，决不与第三方共享。您也可以随时删除您孩子的定制课程。</p>"},
{	"title" : "在我的小尼克学堂中都有哪些内容？",
"answer" :	"<p>我的小尼克学堂为3至7岁的儿童提供寓教于乐的节目，如爱探险的朵拉，Go Diego Go，Team Umizoomi和孔雀鱼泡泡等最受孩子欢迎的剧集。</p>"},
{	"title" : "我的小尼克学堂有什么不同？",
"answer" :	"<p>不像其他频道，我的小尼克学堂是家长根据孩子的喜好，特点的完全定制课程，每个孩子的课程都是独一无二的！</p>"},
{	"title" : "能为孩子的定制课程选择特定的节目吗？",
"answer" : "<p>我的小尼克学堂只能定制学习情境，不能选择特定的剧集或节目。但孩子可以评价自己喜欢的节目，系统会记住这些选择，使这些节目能更频繁地出现在定制课程上。</p>"},
{	"title" : "平台是如何选择内容的呢？",
"answer" : "<p>我们使用由CogniK公司创建的独特推荐引擎。该引擎在法国国家科学研究中心研究实验室的支持下，整合了最先进的人工智能和认知科学技术。</p>"},
{	"title" : "什么是“我的定制课程历史记录”？",
"answer" : "<p>这是孩子在我的小尼克学堂上的学习报告，其中包括孩子在自己的定制课程上的每次学习过程以及观看内容的详细报告，视频标题，学习主题和孩子给出的评价（“我喜欢/我不喜欢”）。</p>"},
{	"title" : "如何选择定制课程的主题？",
"answer" : "<p>家长可以根据11个学习主题，选择适合孩子的方案。您可以为孩子的定制课程选择其中的一个或多个主题。 </p> <p>我的小尼克学堂对每个视频内容都进行了科学分析和编目，在一般情况下，每个视频都对应2-3个不同的学习主题。</p> <p>当选择一个学习主题，如数学，我的小尼克学堂将为孩子从已被确定为可以促进数学知识和实践能力的目录中选择内容。<p></p>家长可以一次选择多个主题，定制课程会交替为每个学习主题选择内容，并且还能为每个学习主题设定难度。</p>"},
{	"title" : "每个学习主题的定义？",
"answer" : "<p> <ul> <li><u>解决问题：</u>您的孩子将学会寻找问题的解决方法，问题的原因或后果。</li> <li><u>记忆力：</u>您的孩子将学会运用自己的记忆力记住物体，字母或数字</li> <li><u>推理：</u>您的孩子将学会如何分析，推理，组织，排序和分类。</li> <li><u>数学：</u>您的孩子将学会使用和提高数学技能。</li> <li><u>好奇心：</u>您的孩子被鼓励好奇心和尝试新事物。</li> <li><u>积极性：</u>开发您孩子的主动性和探索世界的愿望。</li> <li><u>尊重：</u>您的孩子将跟榜样学习，以便更好地了解预期的社会行为。</li> <li><u>友谊：</u>您的孩子将认识新朋友，并能为他们带来经验和教训，进步和适应能力。</li> <li><u>科学与自然：</u>您的孩子将探索大自然，并学习观察能力。</li> <li><u>创造力：</u>您的孩子将得到发展想象力和打开心灵的新体验。</li> <li><u>外语：</u>您的孩子将更多的接触到纯正的外语，单词和对话。</li> </ul> </p>"},
{	"title" : "什么是“知识”和“行为”的定制课程？",
"answer" : "<p>这是两套预先设置的定制课程。如果您希望孩子学会基本的“知识”和“行为”，您可以为孩子定制这两个课程。<ul> <li>第一个预先设置的定制课程“知识”：促进孩子学会掌握基本知识的能力，如解决问题，记忆力和推理能力的发展。</li> <li>第二个预先设置的定制课程“行为”：鼓励孩子开放胸怀，融入他人和周围的环境中，如尊重，友谊和外语。</li> </ul> </p> <p>预先设定的内容不可更改，如果需要更加个性化的定制体验，请返回“目录”菜单进行定制。</p>"},
{	"title" : "每个小孩在学习过程中分为哪些不同的学习阶段？",
"answer" : "<p>临床儿童心理学专家已经对孩子不同的学习阶段作出总结并协助我的小尼克学堂设计一些能帮助您了解孩子学习进度的方法。因为每个小孩有不同的发展步伐，这里只是列举了一些大概的阶段<ul> <li><u>从3岁开始</u>：语言和整个沟通体系正在形成，思维和发育变得复杂，开始出现抽象思维并具备有想象力。</li> <li><u>3到4岁</u>：早期学习的技能在有意识的开发孩子学习的欲望。孩子开始学会计算，记忆，等。。。</li> <li><u>4到5岁</u>：所有知识（阅读，写作，记忆，计算）已经建立并迅速提高。这是一个关键的学习阶段。能更容易区分真实的与虚构。</li> <li><u>5到6岁</u>：孩子已经开始深化和完成所有阶段的学习，发展和探索。</li> </ul> </p>"}]
